testing/log/k6.log
time="2023-10-28T18:53:24+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T18:53:24+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T18:53:25+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T18:53:26+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T18:53:29+07:00" level=info msg="Status: 200 OK" source=console

     data_received..................: 34 MB 961 kB/s
     data_sent......................: 77 kB 2.2 kB/s
   ✓ failures.......................: 0.00% ✓ 0        ✗ 5   
     http_req_blocked...............: avg=1.33s    min=130.3ms med=139.58ms max=6.13s    p(90)=3.74s    p(95)=4.94s   
     http_req_connecting............: avg=676.03ms min=52.88ms med=53.27ms  max=3.16s    p(90)=1.92s    p(95)=2.54s   
     http_req_duration..............: avg=29.47s   min=27.88s  med=29.52s   max=30.92s   p(90)=30.69s   p(95)=30.8s   
       { expected_response:true }...: avg=29.47s   min=27.88s  med=29.52s   max=30.92s   p(90)=30.69s   p(95)=30.8s   
     http_req_failed................: 0.00% ✓ 0        ✗ 5   
     http_req_receiving.............: avg=29.35s   min=27.67s  med=29.42s   max=30.83s   p(90)=30.59s   p(95)=30.71s  
     http_req_sending...............: avg=1.35ms   min=72.83µs med=157.91µs max=5.62ms   p(90)=3.69ms   p(95)=4.66ms  
     http_req_tls_handshaking.......: avg=657.9ms  min=72.96ms med=82.66ms  max=2.96s    p(90)=1.81s    p(95)=2.39s   
     http_req_waiting...............: avg=118.26ms min=89.17ms med=95.08ms  max=217.56ms p(90)=169.41ms p(95)=193.49ms
     http_reqs......................: 5     0.142821/s
     iteration_duration.............: avg=30.8s    min=28.8s   med=30.48s   max=34.02s   p(90)=32.83s   p(95)=33.43s  
     iterations.....................: 5     0.142821/s
     vus............................: 5     min=5      max=10
     vus_max........................: 10    min=10     max=10