testing/log/k6.log
time="2023-10-28T21:32:03+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:04+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:04+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:05+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:06+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:06+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:06+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:07+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:07+07:00" level=info msg="Status: 200 OK" source=console
time="2023-10-28T21:32:07+07:00" level=info msg="Status: 200 OK" source=console

     data_received..................: 35 MB  997 kB/s
     data_sent......................: 109 kB 3.1 kB/s
   ✓ failures.......................: 0.00%  ✓ 0        ✗ 10  
     http_req_blocked...............: avg=121.1ms  min=103.62ms med=121.14ms max=136.29ms p(90)=126.52ms p(95)=131.41ms
     http_req_connecting............: avg=24.01ms  min=21.3ms   med=24.29ms  max=24.52ms  p(90)=24.39ms  p(95)=24.45ms 
     http_req_duration..............: avg=33.13s   min=30.89s   med=33.68s   max=34.65s   p(90)=34.31s   p(95)=34.48s  
       { expected_response:true }...: avg=33.13s   min=30.89s   med=33.68s   max=34.65s   p(90)=34.31s   p(95)=34.48s  
     http_req_failed................: 0.00%  ✓ 0        ✗ 10  
     http_req_receiving.............: avg=32.95s   min=30.87s   med=33.41s   max=34.24s   p(90)=34.14s   p(95)=34.19s  
     http_req_sending...............: avg=251.6µs  min=77.15µs  med=237.93µs max=619.1µs  p(90)=408.18µs p(95)=513.64µs
     http_req_tls_handshaking.......: avg=38.6ms   min=24.58ms  med=38.98ms  max=46.86ms  p(90)=43.8ms   p(95)=45.33ms 
     http_req_waiting...............: avg=176.34ms min=25.88ms  med=33.19ms  max=522.67ms p(90)=518.73ms p(95)=520.7ms 
     http_reqs......................: 10     0.287455/s
     iteration_duration.............: avg=33.25s   min=31s      med=33.8s    max=34.78s   p(90)=34.44s   p(95)=34.61s  
     iterations.....................: 10     0.287455/s
     vus............................: 5      min=5      max=10
     vus_max........................: 10     min=10     max=10