testing/log/load-testing-steadystate.log
→    ✓ status was 200

→    checks.........................: 100.00% ✓ 69       ✗ 0   
→    data_received..................: 783 kB  69 kB/s
→    data_sent......................: 14 kB   1.2 kB/s
→    http_req_blocked...............: avg=175.97ms min=5.23µs   med=7.17µs   max=1.12s    p(90)=580.07ms p(95)=715.24ms
→    http_req_connecting............: avg=15.46ms  min=0s       med=0s       max=109.74ms p(90)=54.05ms  p(95)=54.63ms 
→    http_req_duration..............: avg=485.86ms min=271.26ms med=335.2ms  max=2.53s    p(90)=814.66ms p(95)=882.9ms 
→      { expected_response:true }...: avg=485.86ms min=271.26ms med=335.2ms  max=2.53s    p(90)=814.66ms p(95)=882.9ms 
→    http_req_failed................: 0.00%   ✓ 0        ✗ 69  
→    http_req_receiving.............: avg=87.62ms  min=63.31µs  med=197.9µs  max=2.24s    p(90)=322.12ms p(95)=334.32ms
→    http_req_sending...............: avg=50.27µs  min=17.64µs  med=44.95µs  max=214.29µs p(90)=87.88µs  p(95)=93.32µs 
→    http_req_tls_handshaking.......: avg=159.65ms min=0s       med=0s       max=1.01s    p(90)=522.22ms p(95)=664.02ms
→    http_req_waiting...............: avg=398.19ms min=271ms    med=290.71ms max=2.53s    p(90)=627.04ms p(95)=858.9ms 
→    http_reqs......................: 69      6.062905/s
→    iteration_duration.............: avg=1.66s    min=1.27s    med=1.58s    max=3.53s    p(90)=2.15s    p(95)=2.42s   
→    iterations.....................: 69      6.062905/s
→    vus............................: 8       min=2      max=19
→    vus_max........................: 20      min=20     max=20